# Счетчик с направлением
Вам нужно реализовать с помощью замыканий функцию `counter` для генерации функций-счетчиков. `counter` должен принимать два параметра: `start` - начало отсчета и `inc` - направление счета (убывание или возрастание). Функция-счетчик возвращает свое внутреннее значение а затем увеличивает или уменьшает его на 1 при каждом вызове.  
Сигнатура функции `counter`:
```python
def counter(start=0, inc=True):
    ...
```
Возвращаемые функции-счетчики должны быть независимыми.

### Входные данные:
Функция `counter` принимает два аргумента:  
- `start` - целое число, начало отсчета счетчика  
- `inc` - флаг направления счета, при значении `True` счетчик возрастающий, при `False` - убывающий  

Возвращенная функция-счетчик не требует аргумента и изменяет свое значение в соответствии с указанным направлением.  

### Выходные данные:
Функция `counter` возвращает функцию-счетчик.  
Возвращенная функция в качестве результата выполнения возвращает текущее значение счетчика.  

### Пример:
```python
cnt0 = counter()  # start = 0; inc = True
cnt1 = counter(10, inc=False)

print(cnt0())  # 0
print(cnt0())  # 1

print(cnt1())  # 10
print(cnt1())  # 9

print(cnt0())  # 2
```
